Revit 2027 API
BRepBuilderPersistentIds.IsValidExternalGeometryIdForNewCorrespondence Method
 Validates the input ExternalGeometryId that will be used to create a correspondence. In order to be valid, a correspondence for the input ExternalGeometryId must not already exist.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidExternalGeometryIdForNewCorrespondence(
	ExternalGeometryId externalGeometryId
)
Public Function IsValidExternalGeometryIdForNewCorrespondence (
	externalGeometryId As ExternalGeometryId
) As Boolean
public:
bool IsValidExternalGeometryIdForNewCorrespondence(
	ExternalGeometryId^ externalGeometryId
)
member IsValidExternalGeometryIdForNewCorrespondence :
        externalGeometryId : ExternalGeometryId -> bool
Parameters
externalGeometryId ExternalGeometryId
 The ExternalGeometryId to be used in a new correspondence.
Return Value
Boolean
 True if the input ExternalGeometryId can be used to create a new correspondence.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BRepBuilderPersistentIds Class
Autodesk.Revit.DB Namespace